Textual Data:

In [2]:
import pandas as pd

titanic = pd.read_csv("../data/titanic.csv")
titanic["Name"].str.lower().head() # Make all name characters lowercase

0                               mr. owen harris braund
1    mrs. john bradley (florence briggs thayer) cum...
2                                miss. laina heikkinen
3          mrs. jacques heath (lily may peel) futrelle
4                              mr. william henry allen
Name: Name, dtype: object

In [4]:
titanic["Surname"] = titanic["Name"].str.split("(").str.get(0)
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Surname
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500,Mr. Owen Harris Braund
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833,Mrs. John Bradley
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,Miss. Laina Heikkinen
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,Mrs. Jacques Heath
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,Mr. William Henry Allen

In [5]:
titanic["Name"].str.contains("Countess") #Extract the passenger data about the Countess on board of the Titanic

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
857    False
858    False
859    False
860    False
861    False
862    False
863    False
864    False
865    False
866    False
867    False
868    False
869    False
870    False
871    False
872    False
873    False
874    False
875    False
876    False
877    False
878    False
879    False
880    False
881    False
882    False
883    False
884    False
885    False
886    False
Name: Name, Length: 887, dtype: bool

In [6]:
titanic[titanic["Name"].str.contains("Countess")]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Surname
755,1,1,the Countess. of (Lucy Noel Martha Dyer-Edward...,female,33.0,0,0,86.5,the Countess. of

In [7]:
titanic["Name"].str.len()

0      22
1      50
2      21
3      43
4      23
5      15
6      22
7      29
8      48
9      34
10     30
11     23
12     29
13     26
14     35
15     30
16     19
17     27
18     54
19     22
20     19
21     20
22     18
23     27
24     28
25     56
26     22
27     29
28     19
29     18
       ..
857    26
858    50
859    24
860    21
861    23
862    27
863    35
864    26
865    30
866    16
867    47
868    23
869    26
870    36
871    24
872    28
873    19
874    17
875    44
876    43
877    17
878    27
879    28
880    21
881    35
882    20
883    27
884    30
885    20
886    18
Name: Name, Length: 887, dtype: int64

In [8]:
titanic["Name"].str.len().idxmax()

305

In [9]:
titanic.loc[titanic["Name"].str.len().idxmax(), "Name"] # passenger of the titanic has the longest name

'Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo) Penasco y Castellana'

In [10]:
titanic["Sex_short"] = titanic["Sex"].replace({"male": "M", "female": "F"})
titanic["Sex_short"]  # In the ‘Sex’ columns, replace values of ‘male’ by ‘M’ and all ‘female’ values by ‘F’

0      M
1      F
2      F
3      F
4      M
5      M
6      M
7      M
8      F
9      F
10     F
11     F
12     M
13     M
14     F
15     F
16     M
17     M
18     F
19     F
20     M
21     M
22     F
23     M
24     F
25     F
26     M
27     M
28     F
29     M
      ..
857    M
858    F
859    F
860    M
861    F
862    F
863    M
864    M
865    M
866    M
867    F
868    M
869    M
870    F
871    F
872    M
873    M
874    M
875    F
876    F
877    M
878    F
879    M
880    M
881    F
882    M
883    F
884    F
885    M
886    M
Name: Sex_short, Length: 887, dtype: object